InDeviceMex/EK-TM4C129EXL/TM4C129E_DriverLib/xDriver_MCU/DMA/Peripheral/Register/xHeader/DMA_RegisterPeripheral_Bitbanding.h
/**
 *
 * @file DMA_RegisterPeripheral_Bitbanding.h
 * @copyright
 * @verbatim InDeviceMex 2020 @endverbatim
 *
 * @par Responsibility
 * @verbatim InDeviceMex Developers @endverbatim
 *
 * @version
 * @verbatim 1.0 @endverbatim
 *
 * @date
 * @verbatim 28 jul. 2020 @endverbatim
 *
 * @author
 * @verbatim vyldram @endverbatim
 *
 * @par Change History
 * @verbatim
 * Date           Author     Version     Description * 28 jul. 2020     vyldram    1.0         initial Version@endverbatim
 */

#ifndef XDRIVER_MCU_DRIVER_HEADER_DMA_DMA_PERIPHERAL_DMA_REGISTER_DMA_REGISTERPERIPHERAL_BITBANDING_H_
#define XDRIVER_MCU_DRIVER_HEADER_DMA_DMA_PERIPHERAL_DMA_REGISTER_DMA_REGISTERPERIPHERAL_BITBANDING_H_

#include <xDriver_MCU/DMA/Peripheral/Register/xHeader/DMA_RegisterAddress.h>
#include <xDriver_MCU/DMA/Peripheral/Register/RegisterDefines/DMA_RegisterDefines.h>
#include <xDriver_MCU/DMA/Peripheral/Struct/xHeader/DMA_StructPeripheral_Bitbanding.h>

#define DMA_BITBANDING    ((DMA_BITBANDING_t*) (DMA_BITBANDING_BASE + (DMA_OFFSET * 32UL)))

/********************************************************************************************
************************************** 4 STAT **********************************************
********************************************************************************************/
#define DMA_BITBANDING_STAT    ((DMA_BITBANDING_STAT_t*) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_STAT_OFFSET) * 32UL)))

#define DMA_BITBANDING_STAT_MASTEN    (*((volatile const uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_STAT_OFFSET) * 32UL) + (DMA_STAT_R_MASTEN_BIT * 4UL))))

/********************************************************************************************
************************************** 5 CFG **********************************************
********************************************************************************************/
#define DMA_BITBANDING_CFG    ((DMA_BITBANDING_CFG_t*) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CFG_OFFSET) * 32UL)))

#define DMA_BITBANDING_CFG_MASTEN    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CFG_OFFSET) * 32UL) + (DMA_CFG_R_MASTEN_BIT * 4UL))))

/********************************************************************************************
************************************** 6 CTLBASE **********************************************
********************************************************************************************/
#define DMA_BITBANDING_CTLBASE    ((DMA_BITBANDING_CTLBASE_t*) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CTLBASE_OFFSET) * 32UL)))

/********************************************************************************************
************************************** 7 ALTBASE **********************************************
********************************************************************************************/
#define DMA_BITBANDING_ALTBASE    ((DMA_BITBANDING_ALTBASE_t*) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_ALTBASE_OFFSET) * 32UL)))

/********************************************************************************************
************************************** 8 WAITSTAT **********************************************
********************************************************************************************/
#define DMA_BITBANDING_CH_WAITSTAT    ((DMA_BITBANDING_CH_WAITSTAT_t*) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_WAITSTAT_OFFSET) * 32UL)))

#define DMA_BITBANDING_CH_WAITSTAT_WAITREQ0    (*((volatile const uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_WAITSTAT_OFFSET) * 32UL) + (DMA_CH_WAITSTAT_R_WAITREQ0_BIT * 4UL))))
#define DMA_BITBANDING_CH_WAITSTAT_WAITREQ1    (*((volatile const uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_WAITSTAT_OFFSET) * 32UL) + (DMA_CH_WAITSTAT_R_WAITREQ1_BIT * 4UL))))
#define DMA_BITBANDING_CH_WAITSTAT_WAITREQ2    (*((volatile const uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_WAITSTAT_OFFSET) * 32UL) + (DMA_CH_WAITSTAT_R_WAITREQ2_BIT * 4UL))))
#define DMA_BITBANDING_CH_WAITSTAT_WAITREQ3    (*((volatile const uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_WAITSTAT_OFFSET) * 32UL) + (DMA_CH_WAITSTAT_R_WAITREQ3_BIT * 4UL))))
#define DMA_BITBANDING_CH_WAITSTAT_WAITREQ4    (*((volatile const uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_WAITSTAT_OFFSET) * 32UL) + (DMA_CH_WAITSTAT_R_WAITREQ4_BIT * 4UL))))
#define DMA_BITBANDING_CH_WAITSTAT_WAITREQ5    (*((volatile const uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_WAITSTAT_OFFSET) * 32UL) + (DMA_CH_WAITSTAT_R_WAITREQ5_BIT * 4UL))))
#define DMA_BITBANDING_CH_WAITSTAT_WAITREQ6    (*((volatile const uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_WAITSTAT_OFFSET) * 32UL) + (DMA_CH_WAITSTAT_R_WAITREQ6_BIT * 4UL))))
#define DMA_BITBANDING_CH_WAITSTAT_WAITREQ7    (*((volatile const uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_WAITSTAT_OFFSET) * 32UL) + (DMA_CH_WAITSTAT_R_WAITREQ7_BIT * 4UL))))
#define DMA_BITBANDING_CH_WAITSTAT_WAITREQ8    (*((volatile const uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_WAITSTAT_OFFSET) * 32UL) + (DMA_CH_WAITSTAT_R_WAITREQ8_BIT * 4UL))))
#define DMA_BITBANDING_CH_WAITSTAT_WAITREQ9    (*((volatile const uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_WAITSTAT_OFFSET) * 32UL) + (DMA_CH_WAITSTAT_R_WAITREQ9_BIT * 4UL))))
#define DMA_BITBANDING_CH_WAITSTAT_WAITREQ10    (*((volatile const uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_WAITSTAT_OFFSET) * 32UL) + (DMA_CH_WAITSTAT_R_WAITREQ10_BIT * 4UL))))
#define DMA_BITBANDING_CH_WAITSTAT_WAITREQ11    (*((volatile const uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_WAITSTAT_OFFSET) * 32UL) + (DMA_CH_WAITSTAT_R_WAITREQ11_BIT * 4UL))))
#define DMA_BITBANDING_CH_WAITSTAT_WAITREQ12    (*((volatile const uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_WAITSTAT_OFFSET) * 32UL) + (DMA_CH_WAITSTAT_R_WAITREQ12_BIT * 4UL))))
#define DMA_BITBANDING_CH_WAITSTAT_WAITREQ13    (*((volatile const uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_WAITSTAT_OFFSET) * 32UL) + (DMA_CH_WAITSTAT_R_WAITREQ13_BIT * 4UL))))
#define DMA_BITBANDING_CH_WAITSTAT_WAITREQ14    (*((volatile const uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_WAITSTAT_OFFSET) * 32UL) + (DMA_CH_WAITSTAT_R_WAITREQ14_BIT * 4UL))))
#define DMA_BITBANDING_CH_WAITSTAT_WAITREQ15    (*((volatile const uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_WAITSTAT_OFFSET) * 32UL) + (DMA_CH_WAITSTAT_R_WAITREQ15_BIT * 4UL))))
#define DMA_BITBANDING_CH_WAITSTAT_WAITREQ16    (*((volatile const uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_WAITSTAT_OFFSET) * 32UL) + (DMA_CH_WAITSTAT_R_WAITREQ16_BIT * 4UL))))
#define DMA_BITBANDING_CH_WAITSTAT_WAITREQ17    (*((volatile const uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_WAITSTAT_OFFSET) * 32UL) + (DMA_CH_WAITSTAT_R_WAITREQ17_BIT * 4UL))))
#define DMA_BITBANDING_CH_WAITSTAT_WAITREQ18    (*((volatile const uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_WAITSTAT_OFFSET) * 32UL) + (DMA_CH_WAITSTAT_R_WAITREQ18_BIT * 4UL))))
#define DMA_BITBANDING_CH_WAITSTAT_WAITREQ19    (*((volatile const uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_WAITSTAT_OFFSET) * 32UL) + (DMA_CH_WAITSTAT_R_WAITREQ19_BIT * 4UL))))
#define DMA_BITBANDING_CH_WAITSTAT_WAITREQ20    (*((volatile const uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_WAITSTAT_OFFSET) * 32UL) + (DMA_CH_WAITSTAT_R_WAITREQ20_BIT * 4UL))))
#define DMA_BITBANDING_CH_WAITSTAT_WAITREQ21    (*((volatile const uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_WAITSTAT_OFFSET) * 32UL) + (DMA_CH_WAITSTAT_R_WAITREQ21_BIT * 4UL))))
#define DMA_BITBANDING_CH_WAITSTAT_WAITREQ22    (*((volatile const uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_WAITSTAT_OFFSET) * 32UL) + (DMA_CH_WAITSTAT_R_WAITREQ22_BIT * 4UL))))
#define DMA_BITBANDING_CH_WAITSTAT_WAITREQ23    (*((volatile const uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_WAITSTAT_OFFSET) * 32UL) + (DMA_CH_WAITSTAT_R_WAITREQ23_BIT * 4UL))))
#define DMA_BITBANDING_CH_WAITSTAT_WAITREQ24    (*((volatile const uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_WAITSTAT_OFFSET) * 32UL) + (DMA_CH_WAITSTAT_R_WAITREQ24_BIT * 4UL))))
#define DMA_BITBANDING_CH_WAITSTAT_WAITREQ25    (*((volatile const uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_WAITSTAT_OFFSET) * 32UL) + (DMA_CH_WAITSTAT_R_WAITREQ25_BIT * 4UL))))
#define DMA_BITBANDING_CH_WAITSTAT_WAITREQ26    (*((volatile const uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_WAITSTAT_OFFSET) * 32UL) + (DMA_CH_WAITSTAT_R_WAITREQ26_BIT * 4UL))))
#define DMA_BITBANDING_CH_WAITSTAT_WAITREQ27    (*((volatile const uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_WAITSTAT_OFFSET) * 32UL) + (DMA_CH_WAITSTAT_R_WAITREQ27_BIT * 4UL))))
#define DMA_BITBANDING_CH_WAITSTAT_WAITREQ28    (*((volatile const uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_WAITSTAT_OFFSET) * 32UL) + (DMA_CH_WAITSTAT_R_WAITREQ28_BIT * 4UL))))
#define DMA_BITBANDING_CH_WAITSTAT_WAITREQ29    (*((volatile const uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_WAITSTAT_OFFSET) * 32UL) + (DMA_CH_WAITSTAT_R_WAITREQ29_BIT * 4UL))))
#define DMA_BITBANDING_CH_WAITSTAT_WAITREQ30    (*((volatile const uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_WAITSTAT_OFFSET) * 32UL) + (DMA_CH_WAITSTAT_R_WAITREQ30_BIT * 4UL))))
#define DMA_BITBANDING_CH_WAITSTAT_WAITREQ31    (*((volatile const uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_WAITSTAT_OFFSET) * 32UL) + (DMA_CH_WAITSTAT_R_WAITREQ31_BIT * 4UL))))

/********************************************************************************************
************************************** 9 SWREQ **********************************************
********************************************************************************************/
#define DMA_BITBANDING_CH_SWREQ    ((DMA_BITBANDING_CH_SWREQ_t*) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_SWREQ_OFFSET) * 32UL)))

#define DMA_BITBANDING_CH_SWREQ_SWREQ0    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_SWREQ_OFFSET) * 32UL) + (DMA_CH_SWREQ_R_SWREQ0_BIT * 4UL))))
#define DMA_BITBANDING_CH_SWREQ_SWREQ1    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_SWREQ_OFFSET) * 32UL) + (DMA_CH_SWREQ_R_SWREQ1_BIT * 4UL))))
#define DMA_BITBANDING_CH_SWREQ_SWREQ2    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_SWREQ_OFFSET) * 32UL) + (DMA_CH_SWREQ_R_SWREQ2_BIT * 4UL))))
#define DMA_BITBANDING_CH_SWREQ_SWREQ3    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_SWREQ_OFFSET) * 32UL) + (DMA_CH_SWREQ_R_SWREQ3_BIT * 4UL))))
#define DMA_BITBANDING_CH_SWREQ_SWREQ4    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_SWREQ_OFFSET) * 32UL) + (DMA_CH_SWREQ_R_SWREQ4_BIT * 4UL))))
#define DMA_BITBANDING_CH_SWREQ_SWREQ5    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_SWREQ_OFFSET) * 32UL) + (DMA_CH_SWREQ_R_SWREQ5_BIT * 4UL))))
#define DMA_BITBANDING_CH_SWREQ_SWREQ6    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_SWREQ_OFFSET) * 32UL) + (DMA_CH_SWREQ_R_SWREQ6_BIT * 4UL))))
#define DMA_BITBANDING_CH_SWREQ_SWREQ7    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_SWREQ_OFFSET) * 32UL) + (DMA_CH_SWREQ_R_SWREQ7_BIT * 4UL))))
#define DMA_BITBANDING_CH_SWREQ_SWREQ8    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_SWREQ_OFFSET) * 32UL) + (DMA_CH_SWREQ_R_SWREQ8_BIT * 4UL))))
#define DMA_BITBANDING_CH_SWREQ_SWREQ9    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_SWREQ_OFFSET) * 32UL) + (DMA_CH_SWREQ_R_SWREQ9_BIT * 4UL))))
#define DMA_BITBANDING_CH_SWREQ_SWREQ10    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_SWREQ_OFFSET) * 32UL) + (DMA_CH_SWREQ_R_SWREQ10_BIT * 4UL))))
#define DMA_BITBANDING_CH_SWREQ_SWREQ11    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_SWREQ_OFFSET) * 32UL) + (DMA_CH_SWREQ_R_SWREQ11_BIT * 4UL))))
#define DMA_BITBANDING_CH_SWREQ_SWREQ12    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_SWREQ_OFFSET) * 32UL) + (DMA_CH_SWREQ_R_SWREQ12_BIT * 4UL))))
#define DMA_BITBANDING_CH_SWREQ_SWREQ13    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_SWREQ_OFFSET) * 32UL) + (DMA_CH_SWREQ_R_SWREQ13_BIT * 4UL))))
#define DMA_BITBANDING_CH_SWREQ_SWREQ14    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_SWREQ_OFFSET) * 32UL) + (DMA_CH_SWREQ_R_SWREQ14_BIT * 4UL))))
#define DMA_BITBANDING_CH_SWREQ_SWREQ15    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_SWREQ_OFFSET) * 32UL) + (DMA_CH_SWREQ_R_SWREQ15_BIT * 4UL))))
#define DMA_BITBANDING_CH_SWREQ_SWREQ16    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_SWREQ_OFFSET) * 32UL) + (DMA_CH_SWREQ_R_SWREQ16_BIT * 4UL))))
#define DMA_BITBANDING_CH_SWREQ_SWREQ17    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_SWREQ_OFFSET) * 32UL) + (DMA_CH_SWREQ_R_SWREQ17_BIT * 4UL))))
#define DMA_BITBANDING_CH_SWREQ_SWREQ18    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_SWREQ_OFFSET) * 32UL) + (DMA_CH_SWREQ_R_SWREQ18_BIT * 4UL))))
#define DMA_BITBANDING_CH_SWREQ_SWREQ19    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_SWREQ_OFFSET) * 32UL) + (DMA_CH_SWREQ_R_SWREQ19_BIT * 4UL))))
#define DMA_BITBANDING_CH_SWREQ_SWREQ20    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_SWREQ_OFFSET) * 32UL) + (DMA_CH_SWREQ_R_SWREQ20_BIT * 4UL))))
#define DMA_BITBANDING_CH_SWREQ_SWREQ21    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_SWREQ_OFFSET) * 32UL) + (DMA_CH_SWREQ_R_SWREQ21_BIT * 4UL))))
#define DMA_BITBANDING_CH_SWREQ_SWREQ22    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_SWREQ_OFFSET) * 32UL) + (DMA_CH_SWREQ_R_SWREQ22_BIT * 4UL))))
#define DMA_BITBANDING_CH_SWREQ_SWREQ23    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_SWREQ_OFFSET) * 32UL) + (DMA_CH_SWREQ_R_SWREQ23_BIT * 4UL))))
#define DMA_BITBANDING_CH_SWREQ_SWREQ24    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_SWREQ_OFFSET) * 32UL) + (DMA_CH_SWREQ_R_SWREQ24_BIT * 4UL))))
#define DMA_BITBANDING_CH_SWREQ_SWREQ25    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_SWREQ_OFFSET) * 32UL) + (DMA_CH_SWREQ_R_SWREQ25_BIT * 4UL))))
#define DMA_BITBANDING_CH_SWREQ_SWREQ26    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_SWREQ_OFFSET) * 32UL) + (DMA_CH_SWREQ_R_SWREQ26_BIT * 4UL))))
#define DMA_BITBANDING_CH_SWREQ_SWREQ27    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_SWREQ_OFFSET) * 32UL) + (DMA_CH_SWREQ_R_SWREQ27_BIT * 4UL))))
#define DMA_BITBANDING_CH_SWREQ_SWREQ28    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_SWREQ_OFFSET) * 32UL) + (DMA_CH_SWREQ_R_SWREQ28_BIT * 4UL))))
#define DMA_BITBANDING_CH_SWREQ_SWREQ29    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_SWREQ_OFFSET) * 32UL) + (DMA_CH_SWREQ_R_SWREQ29_BIT * 4UL))))
#define DMA_BITBANDING_CH_SWREQ_SWREQ30    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_SWREQ_OFFSET) * 32UL) + (DMA_CH_SWREQ_R_SWREQ30_BIT * 4UL))))
#define DMA_BITBANDING_CH_SWREQ_SWREQ31    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_SWREQ_OFFSET) * 32UL) + (DMA_CH_SWREQ_R_SWREQ31_BIT * 4UL))))

/********************************************************************************************
************************************** 10 USEBURSTSET **********************************************
********************************************************************************************/
#define DMA_BITBANDING_CH_USEBURSTSET    ((DMA_BITBANDING_CH_SET_t*) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_USEBURSTSET_OFFSET) * 32UL)))

