InDeviceMex/EK-TM4C129EXL/TM4C129E_DriverLib/xDriver_MCU/DMA/Peripheral/Register/xHeader/DMA_RegisterPeripheral_Bitbanding.h
#define DMA_BITBANDING_CH_USEBURSTSET_SET0    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_USEBURSTSET_OFFSET) * 32UL) + (DMA_CH_USEBURSTSET_R_SET0_BIT * 4UL))))
#define DMA_BITBANDING_CH_USEBURSTSET_SET1    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_USEBURSTSET_OFFSET) * 32UL) + (DMA_CH_USEBURSTSET_R_SET1_BIT * 4UL))))
#define DMA_BITBANDING_CH_USEBURSTSET_SET2    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_USEBURSTSET_OFFSET) * 32UL) + (DMA_CH_USEBURSTSET_R_SET2_BIT * 4UL))))
#define DMA_BITBANDING_CH_USEBURSTSET_SET3    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_USEBURSTSET_OFFSET) * 32UL) + (DMA_CH_USEBURSTSET_R_SET3_BIT * 4UL))))
#define DMA_BITBANDING_CH_USEBURSTSET_SET4    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_USEBURSTSET_OFFSET) * 32UL) + (DMA_CH_USEBURSTSET_R_SET4_BIT * 4UL))))
#define DMA_BITBANDING_CH_USEBURSTSET_SET5    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_USEBURSTSET_OFFSET) * 32UL) + (DMA_CH_USEBURSTSET_R_SET5_BIT * 4UL))))
#define DMA_BITBANDING_CH_USEBURSTSET_SET6    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_USEBURSTSET_OFFSET) * 32UL) + (DMA_CH_USEBURSTSET_R_SET6_BIT * 4UL))))
#define DMA_BITBANDING_CH_USEBURSTSET_SET7    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_USEBURSTSET_OFFSET) * 32UL) + (DMA_CH_USEBURSTSET_R_SET7_BIT * 4UL))))
#define DMA_BITBANDING_CH_USEBURSTSET_SET8    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_USEBURSTSET_OFFSET) * 32UL) + (DMA_CH_USEBURSTSET_R_SET8_BIT * 4UL))))
#define DMA_BITBANDING_CH_USEBURSTSET_SET9    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_USEBURSTSET_OFFSET) * 32UL) + (DMA_CH_USEBURSTSET_R_SET9_BIT * 4UL))))
#define DMA_BITBANDING_CH_USEBURSTSET_SET10    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_USEBURSTSET_OFFSET) * 32UL) + (DMA_CH_USEBURSTSET_R_SET10_BIT * 4UL))))
#define DMA_BITBANDING_CH_USEBURSTSET_SET11    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_USEBURSTSET_OFFSET) * 32UL) + (DMA_CH_USEBURSTSET_R_SET11_BIT * 4UL))))
#define DMA_BITBANDING_CH_USEBURSTSET_SET12    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_USEBURSTSET_OFFSET) * 32UL) + (DMA_CH_USEBURSTSET_R_SET12_BIT * 4UL))))
#define DMA_BITBANDING_CH_USEBURSTSET_SET13    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_USEBURSTSET_OFFSET) * 32UL) + (DMA_CH_USEBURSTSET_R_SET13_BIT * 4UL))))
#define DMA_BITBANDING_CH_USEBURSTSET_SET14    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_USEBURSTSET_OFFSET) * 32UL) + (DMA_CH_USEBURSTSET_R_SET14_BIT * 4UL))))
#define DMA_BITBANDING_CH_USEBURSTSET_SET15    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_USEBURSTSET_OFFSET) * 32UL) + (DMA_CH_USEBURSTSET_R_SET15_BIT * 4UL))))
#define DMA_BITBANDING_CH_USEBURSTSET_SET16    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_USEBURSTSET_OFFSET) * 32UL) + (DMA_CH_USEBURSTSET_R_SET16_BIT * 4UL))))
#define DMA_BITBANDING_CH_USEBURSTSET_SET17    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_USEBURSTSET_OFFSET) * 32UL) + (DMA_CH_USEBURSTSET_R_SET17_BIT * 4UL))))
#define DMA_BITBANDING_CH_USEBURSTSET_SET18    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_USEBURSTSET_OFFSET) * 32UL) + (DMA_CH_USEBURSTSET_R_SET18_BIT * 4UL))))
#define DMA_BITBANDING_CH_USEBURSTSET_SET19    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_USEBURSTSET_OFFSET) * 32UL) + (DMA_CH_USEBURSTSET_R_SET19_BIT * 4UL))))
#define DMA_BITBANDING_CH_USEBURSTSET_SET20    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_USEBURSTSET_OFFSET) * 32UL) + (DMA_CH_USEBURSTSET_R_SET20_BIT * 4UL))))
#define DMA_BITBANDING_CH_USEBURSTSET_SET21    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_USEBURSTSET_OFFSET) * 32UL) + (DMA_CH_USEBURSTSET_R_SET21_BIT * 4UL))))
#define DMA_BITBANDING_CH_USEBURSTSET_SET22    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_USEBURSTSET_OFFSET) * 32UL) + (DMA_CH_USEBURSTSET_R_SET22_BIT * 4UL))))
#define DMA_BITBANDING_CH_USEBURSTSET_SET23    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_USEBURSTSET_OFFSET) * 32UL) + (DMA_CH_USEBURSTSET_R_SET23_BIT * 4UL))))
#define DMA_BITBANDING_CH_USEBURSTSET_SET24    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_USEBURSTSET_OFFSET) * 32UL) + (DMA_CH_USEBURSTSET_R_SET24_BIT * 4UL))))
#define DMA_BITBANDING_CH_USEBURSTSET_SET25    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_USEBURSTSET_OFFSET) * 32UL) + (DMA_CH_USEBURSTSET_R_SET25_BIT * 4UL))))
#define DMA_BITBANDING_CH_USEBURSTSET_SET26    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_USEBURSTSET_OFFSET) * 32UL) + (DMA_CH_USEBURSTSET_R_SET26_BIT * 4UL))))
#define DMA_BITBANDING_CH_USEBURSTSET_SET27    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_USEBURSTSET_OFFSET) * 32UL) + (DMA_CH_USEBURSTSET_R_SET27_BIT * 4UL))))
#define DMA_BITBANDING_CH_USEBURSTSET_SET28    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_USEBURSTSET_OFFSET) * 32UL) + (DMA_CH_USEBURSTSET_R_SET28_BIT * 4UL))))
#define DMA_BITBANDING_CH_USEBURSTSET_SET29    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_USEBURSTSET_OFFSET) * 32UL) + (DMA_CH_USEBURSTSET_R_SET29_BIT * 4UL))))
#define DMA_BITBANDING_CH_USEBURSTSET_SET30    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_USEBURSTSET_OFFSET) * 32UL) + (DMA_CH_USEBURSTSET_R_SET30_BIT * 4UL))))
#define DMA_BITBANDING_CH_USEBURSTSET_SET31    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_USEBURSTSET_OFFSET) * 32UL) + (DMA_CH_USEBURSTSET_R_SET31_BIT * 4UL))))

/********************************************************************************************
************************************** 11 USEBURSTCLR **********************************************
********************************************************************************************/
#define DMA_BITBANDING_CH_USEBURSTCLR    ((DMA_BITBANDING_CH_CLR_t*) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_USEBURSTCLR_OFFSET) * 32UL)))

#define DMA_BITBANDING_CH_USEBURSTCLR_CLR0    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_USEBURSTCLR_OFFSET) * 32UL) + (DMA_CH_USEBURSTCLR_R_CLR0_BIT * 4UL))))
#define DMA_BITBANDING_CH_USEBURSTCLR_CLR1    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_USEBURSTCLR_OFFSET) * 32UL) + (DMA_CH_USEBURSTCLR_R_CLR1_BIT * 4UL))))
#define DMA_BITBANDING_CH_USEBURSTCLR_CLR2    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_USEBURSTCLR_OFFSET) * 32UL) + (DMA_CH_USEBURSTCLR_R_CLR2_BIT * 4UL))))
#define DMA_BITBANDING_CH_USEBURSTCLR_CLR3    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_USEBURSTCLR_OFFSET) * 32UL) + (DMA_CH_USEBURSTCLR_R_CLR3_BIT * 4UL))))
#define DMA_BITBANDING_CH_USEBURSTCLR_CLR4    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_USEBURSTCLR_OFFSET) * 32UL) + (DMA_CH_USEBURSTCLR_R_CLR4_BIT * 4UL))))
#define DMA_BITBANDING_CH_USEBURSTCLR_CLR5    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_USEBURSTCLR_OFFSET) * 32UL) + (DMA_CH_USEBURSTCLR_R_CLR5_BIT * 4UL))))
#define DMA_BITBANDING_CH_USEBURSTCLR_CLR6    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_USEBURSTCLR_OFFSET) * 32UL) + (DMA_CH_USEBURSTCLR_R_CLR6_BIT * 4UL))))
#define DMA_BITBANDING_CH_USEBURSTCLR_CLR7    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_USEBURSTCLR_OFFSET) * 32UL) + (DMA_CH_USEBURSTCLR_R_CLR7_BIT * 4UL))))
#define DMA_BITBANDING_CH_USEBURSTCLR_CLR8    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_USEBURSTCLR_OFFSET) * 32UL) + (DMA_CH_USEBURSTCLR_R_CLR8_BIT * 4UL))))
#define DMA_BITBANDING_CH_USEBURSTCLR_CLR9    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_USEBURSTCLR_OFFSET) * 32UL) + (DMA_CH_USEBURSTCLR_R_CLR9_BIT * 4UL))))
#define DMA_BITBANDING_CH_USEBURSTCLR_CLR10    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_USEBURSTCLR_OFFSET) * 32UL) + (DMA_CH_USEBURSTCLR_R_CLR10_BIT * 4UL))))
#define DMA_BITBANDING_CH_USEBURSTCLR_CLR11    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_USEBURSTCLR_OFFSET) * 32UL) + (DMA_CH_USEBURSTCLR_R_CLR11_BIT * 4UL))))
#define DMA_BITBANDING_CH_USEBURSTCLR_CLR12    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_USEBURSTCLR_OFFSET) * 32UL) + (DMA_CH_USEBURSTCLR_R_CLR12_BIT * 4UL))))
#define DMA_BITBANDING_CH_USEBURSTCLR_CLR13    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_USEBURSTCLR_OFFSET) * 32UL) + (DMA_CH_USEBURSTCLR_R_CLR13_BIT * 4UL))))
#define DMA_BITBANDING_CH_USEBURSTCLR_CLR14    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_USEBURSTCLR_OFFSET) * 32UL) + (DMA_CH_USEBURSTCLR_R_CLR14_BIT * 4UL))))
#define DMA_BITBANDING_CH_USEBURSTCLR_CLR15    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_USEBURSTCLR_OFFSET) * 32UL) + (DMA_CH_USEBURSTCLR_R_CLR15_BIT * 4UL))))
#define DMA_BITBANDING_CH_USEBURSTCLR_CLR16    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_USEBURSTCLR_OFFSET) * 32UL) + (DMA_CH_USEBURSTCLR_R_CLR16_BIT * 4UL))))
#define DMA_BITBANDING_CH_USEBURSTCLR_CLR17    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_USEBURSTCLR_OFFSET) * 32UL) + (DMA_CH_USEBURSTCLR_R_CLR17_BIT * 4UL))))
#define DMA_BITBANDING_CH_USEBURSTCLR_CLR18    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_USEBURSTCLR_OFFSET) * 32UL) + (DMA_CH_USEBURSTCLR_R_CLR18_BIT * 4UL))))
#define DMA_BITBANDING_CH_USEBURSTCLR_CLR19    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_USEBURSTCLR_OFFSET) * 32UL) + (DMA_CH_USEBURSTCLR_R_CLR19_BIT * 4UL))))
#define DMA_BITBANDING_CH_USEBURSTCLR_CLR20    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_USEBURSTCLR_OFFSET) * 32UL) + (DMA_CH_USEBURSTCLR_R_CLR20_BIT * 4UL))))
#define DMA_BITBANDING_CH_USEBURSTCLR_CLR21    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_USEBURSTCLR_OFFSET) * 32UL) + (DMA_CH_USEBURSTCLR_R_CLR21_BIT * 4UL))))
#define DMA_BITBANDING_CH_USEBURSTCLR_CLR22    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_USEBURSTCLR_OFFSET) * 32UL) + (DMA_CH_USEBURSTCLR_R_CLR22_BIT * 4UL))))
#define DMA_BITBANDING_CH_USEBURSTCLR_CLR23    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_USEBURSTCLR_OFFSET) * 32UL) + (DMA_CH_USEBURSTCLR_R_CLR23_BIT * 4UL))))
#define DMA_BITBANDING_CH_USEBURSTCLR_CLR24    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_USEBURSTCLR_OFFSET) * 32UL) + (DMA_CH_USEBURSTCLR_R_CLR24_BIT * 4UL))))
#define DMA_BITBANDING_CH_USEBURSTCLR_CLR25    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_USEBURSTCLR_OFFSET) * 32UL) + (DMA_CH_USEBURSTCLR_R_CLR25_BIT * 4UL))))
#define DMA_BITBANDING_CH_USEBURSTCLR_CLR26    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_USEBURSTCLR_OFFSET) * 32UL) + (DMA_CH_USEBURSTCLR_R_CLR26_BIT * 4UL))))
#define DMA_BITBANDING_CH_USEBURSTCLR_CLR27    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_USEBURSTCLR_OFFSET) * 32UL) + (DMA_CH_USEBURSTCLR_R_CLR27_BIT * 4UL))))
#define DMA_BITBANDING_CH_USEBURSTCLR_CLR28    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_USEBURSTCLR_OFFSET) * 32UL) + (DMA_CH_USEBURSTCLR_R_CLR28_BIT * 4UL))))
#define DMA_BITBANDING_CH_USEBURSTCLR_CLR29    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_USEBURSTCLR_OFFSET) * 32UL) + (DMA_CH_USEBURSTCLR_R_CLR29_BIT * 4UL))))
#define DMA_BITBANDING_CH_USEBURSTCLR_CLR30    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_USEBURSTCLR_OFFSET) * 32UL) + (DMA_CH_USEBURSTCLR_R_CLR30_BIT * 4UL))))
#define DMA_BITBANDING_CH_USEBURSTCLR_CLR31    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_USEBURSTCLR_OFFSET) * 32UL) + (DMA_CH_USEBURSTCLR_R_CLR31_BIT * 4UL))))

/********************************************************************************************
************************************** 12 REQMASKSET **********************************************
********************************************************************************************/
#define DMA_BITBANDING_CH_REQMASKSET    ((DMA_BITBANDING_CH_SET_t*) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_REQMASKSET_OFFSET) * 32UL)))

#define DMA_BITBANDING_CH_REQMASKSET_SET0    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_REQMASKSET_OFFSET) * 32UL) + (DMA_CH_REQMASKSET_R_SET0_BIT * 4UL))))
#define DMA_BITBANDING_CH_REQMASKSET_SET1    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_REQMASKSET_OFFSET) * 32UL) + (DMA_CH_REQMASKSET_R_SET1_BIT * 4UL))))
#define DMA_BITBANDING_CH_REQMASKSET_SET2    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_REQMASKSET_OFFSET) * 32UL) + (DMA_CH_REQMASKSET_R_SET2_BIT * 4UL))))
#define DMA_BITBANDING_CH_REQMASKSET_SET3    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_REQMASKSET_OFFSET) * 32UL) + (DMA_CH_REQMASKSET_R_SET3_BIT * 4UL))))
#define DMA_BITBANDING_CH_REQMASKSET_SET4    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_REQMASKSET_OFFSET) * 32UL) + (DMA_CH_REQMASKSET_R_SET4_BIT * 4UL))))
#define DMA_BITBANDING_CH_REQMASKSET_SET5    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_REQMASKSET_OFFSET) * 32UL) + (DMA_CH_REQMASKSET_R_SET5_BIT * 4UL))))
#define DMA_BITBANDING_CH_REQMASKSET_SET6    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_REQMASKSET_OFFSET) * 32UL) + (DMA_CH_REQMASKSET_R_SET6_BIT * 4UL))))
#define DMA_BITBANDING_CH_REQMASKSET_SET7    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_REQMASKSET_OFFSET) * 32UL) + (DMA_CH_REQMASKSET_R_SET7_BIT * 4UL))))
#define DMA_BITBANDING_CH_REQMASKSET_SET8    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_REQMASKSET_OFFSET) * 32UL) + (DMA_CH_REQMASKSET_R_SET8_BIT * 4UL))))
#define DMA_BITBANDING_CH_REQMASKSET_SET9    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_REQMASKSET_OFFSET) * 32UL) + (DMA_CH_REQMASKSET_R_SET9_BIT * 4UL))))
#define DMA_BITBANDING_CH_REQMASKSET_SET10    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_REQMASKSET_OFFSET) * 32UL) + (DMA_CH_REQMASKSET_R_SET10_BIT * 4UL))))
#define DMA_BITBANDING_CH_REQMASKSET_SET11    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_REQMASKSET_OFFSET) * 32UL) + (DMA_CH_REQMASKSET_R_SET11_BIT * 4UL))))
#define DMA_BITBANDING_CH_REQMASKSET_SET12    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_REQMASKSET_OFFSET) * 32UL) + (DMA_CH_REQMASKSET_R_SET12_BIT * 4UL))))
#define DMA_BITBANDING_CH_REQMASKSET_SET13    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_REQMASKSET_OFFSET) * 32UL) + (DMA_CH_REQMASKSET_R_SET13_BIT * 4UL))))
#define DMA_BITBANDING_CH_REQMASKSET_SET14    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_REQMASKSET_OFFSET) * 32UL) + (DMA_CH_REQMASKSET_R_SET14_BIT * 4UL))))
#define DMA_BITBANDING_CH_REQMASKSET_SET15    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_REQMASKSET_OFFSET) * 32UL) + (DMA_CH_REQMASKSET_R_SET15_BIT * 4UL))))
#define DMA_BITBANDING_CH_REQMASKSET_SET16    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_REQMASKSET_OFFSET) * 32UL) + (DMA_CH_REQMASKSET_R_SET16_BIT * 4UL))))
#define DMA_BITBANDING_CH_REQMASKSET_SET17    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_REQMASKSET_OFFSET) * 32UL) + (DMA_CH_REQMASKSET_R_SET17_BIT * 4UL))))
#define DMA_BITBANDING_CH_REQMASKSET_SET18    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_REQMASKSET_OFFSET) * 32UL) + (DMA_CH_REQMASKSET_R_SET18_BIT * 4UL))))
#define DMA_BITBANDING_CH_REQMASKSET_SET19    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_REQMASKSET_OFFSET) * 32UL) + (DMA_CH_REQMASKSET_R_SET19_BIT * 4UL))))
#define DMA_BITBANDING_CH_REQMASKSET_SET20    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_REQMASKSET_OFFSET) * 32UL) + (DMA_CH_REQMASKSET_R_SET20_BIT * 4UL))))
#define DMA_BITBANDING_CH_REQMASKSET_SET21    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_REQMASKSET_OFFSET) * 32UL) + (DMA_CH_REQMASKSET_R_SET21_BIT * 4UL))))
#define DMA_BITBANDING_CH_REQMASKSET_SET22    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_REQMASKSET_OFFSET) * 32UL) + (DMA_CH_REQMASKSET_R_SET22_BIT * 4UL))))
#define DMA_BITBANDING_CH_REQMASKSET_SET23    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_REQMASKSET_OFFSET) * 32UL) + (DMA_CH_REQMASKSET_R_SET23_BIT * 4UL))))
#define DMA_BITBANDING_CH_REQMASKSET_SET24    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_REQMASKSET_OFFSET) * 32UL) + (DMA_CH_REQMASKSET_R_SET24_BIT * 4UL))))
#define DMA_BITBANDING_CH_REQMASKSET_SET25    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_REQMASKSET_OFFSET) * 32UL) + (DMA_CH_REQMASKSET_R_SET25_BIT * 4UL))))
#define DMA_BITBANDING_CH_REQMASKSET_SET26    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_REQMASKSET_OFFSET) * 32UL) + (DMA_CH_REQMASKSET_R_SET26_BIT * 4UL))))
#define DMA_BITBANDING_CH_REQMASKSET_SET27    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_REQMASKSET_OFFSET) * 32UL) + (DMA_CH_REQMASKSET_R_SET27_BIT * 4UL))))
#define DMA_BITBANDING_CH_REQMASKSET_SET28    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_REQMASKSET_OFFSET) * 32UL) + (DMA_CH_REQMASKSET_R_SET28_BIT * 4UL))))
#define DMA_BITBANDING_CH_REQMASKSET_SET29    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_REQMASKSET_OFFSET) * 32UL) + (DMA_CH_REQMASKSET_R_SET29_BIT * 4UL))))
#define DMA_BITBANDING_CH_REQMASKSET_SET30    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_REQMASKSET_OFFSET) * 32UL) + (DMA_CH_REQMASKSET_R_SET30_BIT * 4UL))))
#define DMA_BITBANDING_CH_REQMASKSET_SET31    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_REQMASKSET_OFFSET) * 32UL) + (DMA_CH_REQMASKSET_R_SET31_BIT * 4UL))))

/********************************************************************************************
************************************** 13 REQMASKCLR **********************************************
********************************************************************************************/
#define DMA_BITBANDING_CH_REQMASKCLR    ((DMA_BITBANDING_CH_CLR_t*) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_REQMASKCLR_OFFSET) * 32UL)))

