InDeviceMex/EK-TM4C129EXL/TM4C129E_DriverLib/xDriver_MCU/DMA/Peripheral/Register/xHeader/DMA_RegisterPeripheral_Bitbanding.h
/********************************************************************************************
************************************** 17 ALTCLR **********************************************
********************************************************************************************/
#define DMA_BITBANDING_CH_ALTCLR    ((DMA_BITBANDING_CH_CLR_t*) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_ALTCLR_OFFSET) * 32UL)))

#define DMA_BITBANDING_CH_ALTCLR_CLR0    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_ALTCLR_OFFSET) * 32UL) + (DMA_CH_ALTCLR_R_CLR0_BIT * 4UL))))
#define DMA_BITBANDING_CH_ALTCLR_CLR1    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_ALTCLR_OFFSET) * 32UL) + (DMA_CH_ALTCLR_R_CLR1_BIT * 4UL))))
#define DMA_BITBANDING_CH_ALTCLR_CLR2    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_ALTCLR_OFFSET) * 32UL) + (DMA_CH_ALTCLR_R_CLR2_BIT * 4UL))))
#define DMA_BITBANDING_CH_ALTCLR_CLR3    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_ALTCLR_OFFSET) * 32UL) + (DMA_CH_ALTCLR_R_CLR3_BIT * 4UL))))
#define DMA_BITBANDING_CH_ALTCLR_CLR4    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_ALTCLR_OFFSET) * 32UL) + (DMA_CH_ALTCLR_R_CLR4_BIT * 4UL))))
#define DMA_BITBANDING_CH_ALTCLR_CLR5    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_ALTCLR_OFFSET) * 32UL) + (DMA_CH_ALTCLR_R_CLR5_BIT * 4UL))))
#define DMA_BITBANDING_CH_ALTCLR_CLR6    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_ALTCLR_OFFSET) * 32UL) + (DMA_CH_ALTCLR_R_CLR6_BIT * 4UL))))
#define DMA_BITBANDING_CH_ALTCLR_CLR7    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_ALTCLR_OFFSET) * 32UL) + (DMA_CH_ALTCLR_R_CLR7_BIT * 4UL))))
#define DMA_BITBANDING_CH_ALTCLR_CLR8    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_ALTCLR_OFFSET) * 32UL) + (DMA_CH_ALTCLR_R_CLR8_BIT * 4UL))))
#define DMA_BITBANDING_CH_ALTCLR_CLR9    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_ALTCLR_OFFSET) * 32UL) + (DMA_CH_ALTCLR_R_CLR9_BIT * 4UL))))
#define DMA_BITBANDING_CH_ALTCLR_CLR10    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_ALTCLR_OFFSET) * 32UL) + (DMA_CH_ALTCLR_R_CLR10_BIT * 4UL))))
#define DMA_BITBANDING_CH_ALTCLR_CLR11    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_ALTCLR_OFFSET) * 32UL) + (DMA_CH_ALTCLR_R_CLR11_BIT * 4UL))))
#define DMA_BITBANDING_CH_ALTCLR_CLR12    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_ALTCLR_OFFSET) * 32UL) + (DMA_CH_ALTCLR_R_CLR12_BIT * 4UL))))
#define DMA_BITBANDING_CH_ALTCLR_CLR13    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_ALTCLR_OFFSET) * 32UL) + (DMA_CH_ALTCLR_R_CLR13_BIT * 4UL))))
#define DMA_BITBANDING_CH_ALTCLR_CLR14    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_ALTCLR_OFFSET) * 32UL) + (DMA_CH_ALTCLR_R_CLR14_BIT * 4UL))))
#define DMA_BITBANDING_CH_ALTCLR_CLR15    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_ALTCLR_OFFSET) * 32UL) + (DMA_CH_ALTCLR_R_CLR15_BIT * 4UL))))
#define DMA_BITBANDING_CH_ALTCLR_CLR16    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_ALTCLR_OFFSET) * 32UL) + (DMA_CH_ALTCLR_R_CLR16_BIT * 4UL))))
#define DMA_BITBANDING_CH_ALTCLR_CLR17    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_ALTCLR_OFFSET) * 32UL) + (DMA_CH_ALTCLR_R_CLR17_BIT * 4UL))))
#define DMA_BITBANDING_CH_ALTCLR_CLR18    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_ALTCLR_OFFSET) * 32UL) + (DMA_CH_ALTCLR_R_CLR18_BIT * 4UL))))
#define DMA_BITBANDING_CH_ALTCLR_CLR19    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_ALTCLR_OFFSET) * 32UL) + (DMA_CH_ALTCLR_R_CLR19_BIT * 4UL))))
#define DMA_BITBANDING_CH_ALTCLR_CLR20    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_ALTCLR_OFFSET) * 32UL) + (DMA_CH_ALTCLR_R_CLR20_BIT * 4UL))))
#define DMA_BITBANDING_CH_ALTCLR_CLR21    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_ALTCLR_OFFSET) * 32UL) + (DMA_CH_ALTCLR_R_CLR21_BIT * 4UL))))
#define DMA_BITBANDING_CH_ALTCLR_CLR22    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_ALTCLR_OFFSET) * 32UL) + (DMA_CH_ALTCLR_R_CLR22_BIT * 4UL))))
#define DMA_BITBANDING_CH_ALTCLR_CLR23    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_ALTCLR_OFFSET) * 32UL) + (DMA_CH_ALTCLR_R_CLR23_BIT * 4UL))))
#define DMA_BITBANDING_CH_ALTCLR_CLR24    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_ALTCLR_OFFSET) * 32UL) + (DMA_CH_ALTCLR_R_CLR24_BIT * 4UL))))
#define DMA_BITBANDING_CH_ALTCLR_CLR25    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_ALTCLR_OFFSET) * 32UL) + (DMA_CH_ALTCLR_R_CLR25_BIT * 4UL))))
#define DMA_BITBANDING_CH_ALTCLR_CLR26    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_ALTCLR_OFFSET) * 32UL) + (DMA_CH_ALTCLR_R_CLR26_BIT * 4UL))))
#define DMA_BITBANDING_CH_ALTCLR_CLR27    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_ALTCLR_OFFSET) * 32UL) + (DMA_CH_ALTCLR_R_CLR27_BIT * 4UL))))
#define DMA_BITBANDING_CH_ALTCLR_CLR28    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_ALTCLR_OFFSET) * 32UL) + (DMA_CH_ALTCLR_R_CLR28_BIT * 4UL))))
#define DMA_BITBANDING_CH_ALTCLR_CLR29    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_ALTCLR_OFFSET) * 32UL) + (DMA_CH_ALTCLR_R_CLR29_BIT * 4UL))))
#define DMA_BITBANDING_CH_ALTCLR_CLR30    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_ALTCLR_OFFSET) * 32UL) + (DMA_CH_ALTCLR_R_CLR30_BIT * 4UL))))
#define DMA_BITBANDING_CH_ALTCLR_CLR31    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_ALTCLR_OFFSET) * 32UL) + (DMA_CH_ALTCLR_R_CLR31_BIT * 4UL))))

/********************************************************************************************
************************************* 18 PRIOSET **********************************************
********************************************************************************************/
#define DMA_BITBANDING_CH_PRIOSET    ((DMA_BITBANDING_CH_SET_t*) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_PRIOSET_OFFSET) * 32UL)))

#define DMA_BITBANDING_CH_PRIOSET_SET0    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_PRIOSET_OFFSET) * 32UL) + (DMA_CH_PRIOSET_R_SET0_BIT * 4UL))))
#define DMA_BITBANDING_CH_PRIOSET_SET1    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_PRIOSET_OFFSET) * 32UL) + (DMA_CH_PRIOSET_R_SET1_BIT * 4UL))))
#define DMA_BITBANDING_CH_PRIOSET_SET2    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_PRIOSET_OFFSET) * 32UL) + (DMA_CH_PRIOSET_R_SET2_BIT * 4UL))))
#define DMA_BITBANDING_CH_PRIOSET_SET3    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_PRIOSET_OFFSET) * 32UL) + (DMA_CH_PRIOSET_R_SET3_BIT * 4UL))))
#define DMA_BITBANDING_CH_PRIOSET_SET4    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_PRIOSET_OFFSET) * 32UL) + (DMA_CH_PRIOSET_R_SET4_BIT * 4UL))))
#define DMA_BITBANDING_CH_PRIOSET_SET5    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_PRIOSET_OFFSET) * 32UL) + (DMA_CH_PRIOSET_R_SET5_BIT * 4UL))))
#define DMA_BITBANDING_CH_PRIOSET_SET6    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_PRIOSET_OFFSET) * 32UL) + (DMA_CH_PRIOSET_R_SET6_BIT * 4UL))))
#define DMA_BITBANDING_CH_PRIOSET_SET7    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_PRIOSET_OFFSET) * 32UL) + (DMA_CH_PRIOSET_R_SET7_BIT * 4UL))))
#define DMA_BITBANDING_CH_PRIOSET_SET8    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_PRIOSET_OFFSET) * 32UL) + (DMA_CH_PRIOSET_R_SET8_BIT * 4UL))))
#define DMA_BITBANDING_CH_PRIOSET_SET9    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_PRIOSET_OFFSET) * 32UL) + (DMA_CH_PRIOSET_R_SET9_BIT * 4UL))))
#define DMA_BITBANDING_CH_PRIOSET_SET10    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_PRIOSET_OFFSET) * 32UL) + (DMA_CH_PRIOSET_R_SET10_BIT * 4UL))))
#define DMA_BITBANDING_CH_PRIOSET_SET11    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_PRIOSET_OFFSET) * 32UL) + (DMA_CH_PRIOSET_R_SET11_BIT * 4UL))))
#define DMA_BITBANDING_CH_PRIOSET_SET12    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_PRIOSET_OFFSET) * 32UL) + (DMA_CH_PRIOSET_R_SET12_BIT * 4UL))))
#define DMA_BITBANDING_CH_PRIOSET_SET13    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_PRIOSET_OFFSET) * 32UL) + (DMA_CH_PRIOSET_R_SET13_BIT * 4UL))))
#define DMA_BITBANDING_CH_PRIOSET_SET14    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_PRIOSET_OFFSET) * 32UL) + (DMA_CH_PRIOSET_R_SET14_BIT * 4UL))))
#define DMA_BITBANDING_CH_PRIOSET_SET15    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_PRIOSET_OFFSET) * 32UL) + (DMA_CH_PRIOSET_R_SET15_BIT * 4UL))))
#define DMA_BITBANDING_CH_PRIOSET_SET16    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_PRIOSET_OFFSET) * 32UL) + (DMA_CH_PRIOSET_R_SET16_BIT * 4UL))))
#define DMA_BITBANDING_CH_PRIOSET_SET17    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_PRIOSET_OFFSET) * 32UL) + (DMA_CH_PRIOSET_R_SET17_BIT * 4UL))))
#define DMA_BITBANDING_CH_PRIOSET_SET18    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_PRIOSET_OFFSET) * 32UL) + (DMA_CH_PRIOSET_R_SET18_BIT * 4UL))))
#define DMA_BITBANDING_CH_PRIOSET_SET19    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_PRIOSET_OFFSET) * 32UL) + (DMA_CH_PRIOSET_R_SET19_BIT * 4UL))))
#define DMA_BITBANDING_CH_PRIOSET_SET20    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_PRIOSET_OFFSET) * 32UL) + (DMA_CH_PRIOSET_R_SET20_BIT * 4UL))))
#define DMA_BITBANDING_CH_PRIOSET_SET21    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_PRIOSET_OFFSET) * 32UL) + (DMA_CH_PRIOSET_R_SET21_BIT * 4UL))))
#define DMA_BITBANDING_CH_PRIOSET_SET22    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_PRIOSET_OFFSET) * 32UL) + (DMA_CH_PRIOSET_R_SET22_BIT * 4UL))))
#define DMA_BITBANDING_CH_PRIOSET_SET23    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_PRIOSET_OFFSET) * 32UL) + (DMA_CH_PRIOSET_R_SET23_BIT * 4UL))))
#define DMA_BITBANDING_CH_PRIOSET_SET24    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_PRIOSET_OFFSET) * 32UL) + (DMA_CH_PRIOSET_R_SET24_BIT * 4UL))))
#define DMA_BITBANDING_CH_PRIOSET_SET25    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_PRIOSET_OFFSET) * 32UL) + (DMA_CH_PRIOSET_R_SET25_BIT * 4UL))))
#define DMA_BITBANDING_CH_PRIOSET_SET26    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_PRIOSET_OFFSET) * 32UL) + (DMA_CH_PRIOSET_R_SET26_BIT * 4UL))))
#define DMA_BITBANDING_CH_PRIOSET_SET27    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_PRIOSET_OFFSET) * 32UL) + (DMA_CH_PRIOSET_R_SET27_BIT * 4UL))))
#define DMA_BITBANDING_CH_PRIOSET_SET28    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_PRIOSET_OFFSET) * 32UL) + (DMA_CH_PRIOSET_R_SET28_BIT * 4UL))))
#define DMA_BITBANDING_CH_PRIOSET_SET29    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_PRIOSET_OFFSET) * 32UL) + (DMA_CH_PRIOSET_R_SET29_BIT * 4UL))))
#define DMA_BITBANDING_CH_PRIOSET_SET30    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_PRIOSET_OFFSET) * 32UL) + (DMA_CH_PRIOSET_R_SET30_BIT * 4UL))))
#define DMA_BITBANDING_CH_PRIOSET_SET31    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_PRIOSET_OFFSET) * 32UL) + (DMA_CH_PRIOSET_R_SET31_BIT * 4UL))))

/********************************************************************************************
************************************** 19 PRIOCLR **********************************************
********************************************************************************************/
#define DMA_BITBANDING_CH_PRIOCLR    ((DMA_BITBANDING_CH_CLR_t*) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_PRIOCLR_OFFSET) * 32UL)))

#define DMA_BITBANDING_CH_PRIOCLR_CLR0    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_PRIOCLR_OFFSET) * 32UL) + (DMA_CH_PRIOCLR_R_CLR0_BIT * 4UL))))
#define DMA_BITBANDING_CH_PRIOCLR_CLR1    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_PRIOCLR_OFFSET) * 32UL) + (DMA_CH_PRIOCLR_R_CLR1_BIT * 4UL))))
#define DMA_BITBANDING_CH_PRIOCLR_CLR2    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_PRIOCLR_OFFSET) * 32UL) + (DMA_CH_PRIOCLR_R_CLR2_BIT * 4UL))))
#define DMA_BITBANDING_CH_PRIOCLR_CLR3    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_PRIOCLR_OFFSET) * 32UL) + (DMA_CH_PRIOCLR_R_CLR3_BIT * 4UL))))
#define DMA_BITBANDING_CH_PRIOCLR_CLR4    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_PRIOCLR_OFFSET) * 32UL) + (DMA_CH_PRIOCLR_R_CLR4_BIT * 4UL))))
#define DMA_BITBANDING_CH_PRIOCLR_CLR5    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_PRIOCLR_OFFSET) * 32UL) + (DMA_CH_PRIOCLR_R_CLR5_BIT * 4UL))))
#define DMA_BITBANDING_CH_PRIOCLR_CLR6    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_PRIOCLR_OFFSET) * 32UL) + (DMA_CH_PRIOCLR_R_CLR6_BIT * 4UL))))
#define DMA_BITBANDING_CH_PRIOCLR_CLR7    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_PRIOCLR_OFFSET) * 32UL) + (DMA_CH_PRIOCLR_R_CLR7_BIT * 4UL))))
#define DMA_BITBANDING_CH_PRIOCLR_CLR8    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_PRIOCLR_OFFSET) * 32UL) + (DMA_CH_PRIOCLR_R_CLR8_BIT * 4UL))))
#define DMA_BITBANDING_CH_PRIOCLR_CLR9    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_PRIOCLR_OFFSET) * 32UL) + (DMA_CH_PRIOCLR_R_CLR9_BIT * 4UL))))
#define DMA_BITBANDING_CH_PRIOCLR_CLR10    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_PRIOCLR_OFFSET) * 32UL) + (DMA_CH_PRIOCLR_R_CLR10_BIT * 4UL))))
#define DMA_BITBANDING_CH_PRIOCLR_CLR11    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_PRIOCLR_OFFSET) * 32UL) + (DMA_CH_PRIOCLR_R_CLR11_BIT * 4UL))))
#define DMA_BITBANDING_CH_PRIOCLR_CLR12    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_PRIOCLR_OFFSET) * 32UL) + (DMA_CH_PRIOCLR_R_CLR12_BIT * 4UL))))
#define DMA_BITBANDING_CH_PRIOCLR_CLR13    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_PRIOCLR_OFFSET) * 32UL) + (DMA_CH_PRIOCLR_R_CLR13_BIT * 4UL))))
#define DMA_BITBANDING_CH_PRIOCLR_CLR14    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_PRIOCLR_OFFSET) * 32UL) + (DMA_CH_PRIOCLR_R_CLR14_BIT * 4UL))))
#define DMA_BITBANDING_CH_PRIOCLR_CLR15    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_PRIOCLR_OFFSET) * 32UL) + (DMA_CH_PRIOCLR_R_CLR15_BIT * 4UL))))
#define DMA_BITBANDING_CH_PRIOCLR_CLR16    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_PRIOCLR_OFFSET) * 32UL) + (DMA_CH_PRIOCLR_R_CLR16_BIT * 4UL))))
#define DMA_BITBANDING_CH_PRIOCLR_CLR17    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_PRIOCLR_OFFSET) * 32UL) + (DMA_CH_PRIOCLR_R_CLR17_BIT * 4UL))))
#define DMA_BITBANDING_CH_PRIOCLR_CLR18    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_PRIOCLR_OFFSET) * 32UL) + (DMA_CH_PRIOCLR_R_CLR18_BIT * 4UL))))
#define DMA_BITBANDING_CH_PRIOCLR_CLR19    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_PRIOCLR_OFFSET) * 32UL) + (DMA_CH_PRIOCLR_R_CLR19_BIT * 4UL))))
#define DMA_BITBANDING_CH_PRIOCLR_CLR20    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_PRIOCLR_OFFSET) * 32UL) + (DMA_CH_PRIOCLR_R_CLR20_BIT * 4UL))))
#define DMA_BITBANDING_CH_PRIOCLR_CLR21    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_PRIOCLR_OFFSET) * 32UL) + (DMA_CH_PRIOCLR_R_CLR21_BIT * 4UL))))
#define DMA_BITBANDING_CH_PRIOCLR_CLR22    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_PRIOCLR_OFFSET) * 32UL) + (DMA_CH_PRIOCLR_R_CLR22_BIT * 4UL))))
#define DMA_BITBANDING_CH_PRIOCLR_CLR23    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_PRIOCLR_OFFSET) * 32UL) + (DMA_CH_PRIOCLR_R_CLR23_BIT * 4UL))))
#define DMA_BITBANDING_CH_PRIOCLR_CLR24    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_PRIOCLR_OFFSET) * 32UL) + (DMA_CH_PRIOCLR_R_CLR24_BIT * 4UL))))
#define DMA_BITBANDING_CH_PRIOCLR_CLR25    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_PRIOCLR_OFFSET) * 32UL) + (DMA_CH_PRIOCLR_R_CLR25_BIT * 4UL))))
#define DMA_BITBANDING_CH_PRIOCLR_CLR26    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_PRIOCLR_OFFSET) * 32UL) + (DMA_CH_PRIOCLR_R_CLR26_BIT * 4UL))))
#define DMA_BITBANDING_CH_PRIOCLR_CLR27    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_PRIOCLR_OFFSET) * 32UL) + (DMA_CH_PRIOCLR_R_CLR27_BIT * 4UL))))
#define DMA_BITBANDING_CH_PRIOCLR_CLR28    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_PRIOCLR_OFFSET) * 32UL) + (DMA_CH_PRIOCLR_R_CLR28_BIT * 4UL))))
#define DMA_BITBANDING_CH_PRIOCLR_CLR29    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_PRIOCLR_OFFSET) * 32UL) + (DMA_CH_PRIOCLR_R_CLR29_BIT * 4UL))))
#define DMA_BITBANDING_CH_PRIOCLR_CLR30    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_PRIOCLR_OFFSET) * 32UL) + (DMA_CH_PRIOCLR_R_CLR30_BIT * 4UL))))
#define DMA_BITBANDING_CH_PRIOCLR_CLR31    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_PRIOCLR_OFFSET) * 32UL) + (DMA_CH_PRIOCLR_R_CLR31_BIT * 4UL))))

/********************************************************************************************
************************************** 20 ERRCLR **********************************************
********************************************************************************************/
#define DMA_BITBANDING_ERRCLR    ((DMA_BITBANDING_ERRCLR_t*) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_ERRCLR_OFFSET) * 32UL)))

#define DMA_BITBANDING_ERRCLR_ERRCLR    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_ERRCLR_OFFSET) * 32UL) + (DMA_ERRCLR_R_ERRCLR_BIT * 4UL))))

/********************************************************************************************
************************************** 21 CHASGN **********************************************
********************************************************************************************/
#define DMA_BITBANDING_CH_ASGN    ((DMA_BITBANDING_CH_ASGN_t*) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_ASGN_OFFSET) * 32UL)))

