InDeviceMex/EK-TM4C129EXL/TM4C129E_DriverLib/xDriver_MCU/DMA/Peripheral/Register/xHeader/DMA_RegisterPeripheral_Bitbanding.h
#define DMA_BITBANDING_CH_ASGN_ASGN0    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_ASGN_OFFSET) * 32UL) + (DMA_CH_ASGN_R_ASGN0_BIT * 4UL))))
#define DMA_BITBANDING_CH_ASGN_ASGN1    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_ASGN_OFFSET) * 32UL) + (DMA_CH_ASGN_R_ASGN1_BIT * 4UL))))
#define DMA_BITBANDING_CH_ASGN_ASGN2    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_ASGN_OFFSET) * 32UL) + (DMA_CH_ASGN_R_ASGN2_BIT * 4UL))))
#define DMA_BITBANDING_CH_ASGN_ASGN3    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_ASGN_OFFSET) * 32UL) + (DMA_CH_ASGN_R_ASGN3_BIT * 4UL))))
#define DMA_BITBANDING_CH_ASGN_ASGN4    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_ASGN_OFFSET) * 32UL) + (DMA_CH_ASGN_R_ASGN4_BIT * 4UL))))
#define DMA_BITBANDING_CH_ASGN_ASGN5    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_ASGN_OFFSET) * 32UL) + (DMA_CH_ASGN_R_ASGN5_BIT * 4UL))))
#define DMA_BITBANDING_CH_ASGN_ASGN6    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_ASGN_OFFSET) * 32UL) + (DMA_CH_ASGN_R_ASGN6_BIT * 4UL))))
#define DMA_BITBANDING_CH_ASGN_ASGN7    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_ASGN_OFFSET) * 32UL) + (DMA_CH_ASGN_R_ASGN7_BIT * 4UL))))
#define DMA_BITBANDING_CH_ASGN_ASGN8    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_ASGN_OFFSET) * 32UL) + (DMA_CH_ASGN_R_ASGN8_BIT * 4UL))))
#define DMA_BITBANDING_CH_ASGN_ASGN9    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_ASGN_OFFSET) * 32UL) + (DMA_CH_ASGN_R_ASGN9_BIT * 4UL))))
#define DMA_BITBANDING_CH_ASGN_ASGN10    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_ASGN_OFFSET) * 32UL) + (DMA_CH_ASGN_R_ASGN10_BIT * 4UL))))
#define DMA_BITBANDING_CH_ASGN_ASGN11    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_ASGN_OFFSET) * 32UL) + (DMA_CH_ASGN_R_ASGN11_BIT * 4UL))))
#define DMA_BITBANDING_CH_ASGN_ASGN12    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_ASGN_OFFSET) * 32UL) + (DMA_CH_ASGN_R_ASGN12_BIT * 4UL))))
#define DMA_BITBANDING_CH_ASGN_ASGN13    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_ASGN_OFFSET) * 32UL) + (DMA_CH_ASGN_R_ASGN13_BIT * 4UL))))
#define DMA_BITBANDING_CH_ASGN_ASGN14    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_ASGN_OFFSET) * 32UL) + (DMA_CH_ASGN_R_ASGN14_BIT * 4UL))))
#define DMA_BITBANDING_CH_ASGN_ASGN15    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_ASGN_OFFSET) * 32UL) + (DMA_CH_ASGN_R_ASGN15_BIT * 4UL))))
#define DMA_BITBANDING_CH_ASGN_ASGN16    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_ASGN_OFFSET) * 32UL) + (DMA_CH_ASGN_R_ASGN16_BIT * 4UL))))
#define DMA_BITBANDING_CH_ASGN_ASGN17    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_ASGN_OFFSET) * 32UL) + (DMA_CH_ASGN_R_ASGN17_BIT * 4UL))))
#define DMA_BITBANDING_CH_ASGN_ASGN18    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_ASGN_OFFSET) * 32UL) + (DMA_CH_ASGN_R_ASGN18_BIT * 4UL))))
#define DMA_BITBANDING_CH_ASGN_ASGN19    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_ASGN_OFFSET) * 32UL) + (DMA_CH_ASGN_R_ASGN19_BIT * 4UL))))
#define DMA_BITBANDING_CH_ASGN_ASGN20    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_ASGN_OFFSET) * 32UL) + (DMA_CH_ASGN_R_ASGN20_BIT * 4UL))))
#define DMA_BITBANDING_CH_ASGN_ASGN21    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_ASGN_OFFSET) * 32UL) + (DMA_CH_ASGN_R_ASGN21_BIT * 4UL))))
#define DMA_BITBANDING_CH_ASGN_ASGN22    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_ASGN_OFFSET) * 32UL) + (DMA_CH_ASGN_R_ASGN22_BIT * 4UL))))
#define DMA_BITBANDING_CH_ASGN_ASGN23    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_ASGN_OFFSET) * 32UL) + (DMA_CH_ASGN_R_ASGN23_BIT * 4UL))))
#define DMA_BITBANDING_CH_ASGN_ASGN24    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_ASGN_OFFSET) * 32UL) + (DMA_CH_ASGN_R_ASGN24_BIT * 4UL))))
#define DMA_BITBANDING_CH_ASGN_ASGN25    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_ASGN_OFFSET) * 32UL) + (DMA_CH_ASGN_R_ASGN25_BIT * 4UL))))
#define DMA_BITBANDING_CH_ASGN_ASGN26    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_ASGN_OFFSET) * 32UL) + (DMA_CH_ASGN_R_ASGN26_BIT * 4UL))))
#define DMA_BITBANDING_CH_ASGN_ASGN27    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_ASGN_OFFSET) * 32UL) + (DMA_CH_ASGN_R_ASGN27_BIT * 4UL))))
#define DMA_BITBANDING_CH_ASGN_ASGN28    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_ASGN_OFFSET) * 32UL) + (DMA_CH_ASGN_R_ASGN28_BIT * 4UL))))
#define DMA_BITBANDING_CH_ASGN_ASGN29    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_ASGN_OFFSET) * 32UL) + (DMA_CH_ASGN_R_ASGN29_BIT * 4UL))))
#define DMA_BITBANDING_CH_ASGN_ASGN30    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_ASGN_OFFSET) * 32UL) + (DMA_CH_ASGN_R_ASGN30_BIT * 4UL))))
#define DMA_BITBANDING_CH_ASGN_ASGN31    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_ASGN_OFFSET) * 32UL) + (DMA_CH_ASGN_R_ASGN31_BIT * 4UL))))

/********************************************************************************************
************************************** 22 CHIS **********************************************
********************************************************************************************/
#define DMA_BITBANDING_CH_IS    ((DMA_BITBANDING_CH_IS_t*) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_IS_OFFSET) * 32UL)))

#define DMA_BITBANDING_CH_IS_IS0    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_IS_OFFSET) * 32UL) + (DMA_CH_IS_R_IS0_BIT * 4UL))))
#define DMA_BITBANDING_CH_IS_IS1    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_IS_OFFSET) * 32UL) + (DMA_CH_IS_R_IS1_BIT * 4UL))))
#define DMA_BITBANDING_CH_IS_IS2    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_IS_OFFSET) * 32UL) + (DMA_CH_IS_R_IS2_BIT * 4UL))))
#define DMA_BITBANDING_CH_IS_IS3    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_IS_OFFSET) * 32UL) + (DMA_CH_IS_R_IS3_BIT * 4UL))))
#define DMA_BITBANDING_CH_IS_IS4    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_IS_OFFSET) * 32UL) + (DMA_CH_IS_R_IS4_BIT * 4UL))))
#define DMA_BITBANDING_CH_IS_IS5    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_IS_OFFSET) * 32UL) + (DMA_CH_IS_R_IS5_BIT * 4UL))))
#define DMA_BITBANDING_CH_IS_IS6    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_IS_OFFSET) * 32UL) + (DMA_CH_IS_R_IS6_BIT * 4UL))))
#define DMA_BITBANDING_CH_IS_IS7    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_IS_OFFSET) * 32UL) + (DMA_CH_IS_R_IS7_BIT * 4UL))))
#define DMA_BITBANDING_CH_IS_IS8    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_IS_OFFSET) * 32UL) + (DMA_CH_IS_R_IS8_BIT * 4UL))))
#define DMA_BITBANDING_CH_IS_IS9    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_IS_OFFSET) * 32UL) + (DMA_CH_IS_R_IS9_BIT * 4UL))))
#define DMA_BITBANDING_CH_IS_IS10    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_IS_OFFSET) * 32UL) + (DMA_CH_IS_R_IS10_BIT * 4UL))))
#define DMA_BITBANDING_CH_IS_IS11    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_IS_OFFSET) * 32UL) + (DMA_CH_IS_R_IS11_BIT * 4UL))))
#define DMA_BITBANDING_CH_IS_IS12    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_IS_OFFSET) * 32UL) + (DMA_CH_IS_R_IS12_BIT * 4UL))))
#define DMA_BITBANDING_CH_IS_IS13    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_IS_OFFSET) * 32UL) + (DMA_CH_IS_R_IS13_BIT * 4UL))))
#define DMA_BITBANDING_CH_IS_IS14    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_IS_OFFSET) * 32UL) + (DMA_CH_IS_R_IS14_BIT * 4UL))))
#define DMA_BITBANDING_CH_IS_IS15    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_IS_OFFSET) * 32UL) + (DMA_CH_IS_R_IS15_BIT * 4UL))))
#define DMA_BITBANDING_CH_IS_IS16    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_IS_OFFSET) * 32UL) + (DMA_CH_IS_R_IS16_BIT * 4UL))))
#define DMA_BITBANDING_CH_IS_IS17    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_IS_OFFSET) * 32UL) + (DMA_CH_IS_R_IS17_BIT * 4UL))))
#define DMA_BITBANDING_CH_IS_IS18    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_IS_OFFSET) * 32UL) + (DMA_CH_IS_R_IS18_BIT * 4UL))))
#define DMA_BITBANDING_CH_IS_IS19    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_IS_OFFSET) * 32UL) + (DMA_CH_IS_R_IS19_BIT * 4UL))))
#define DMA_BITBANDING_CH_IS_IS20    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_IS_OFFSET) * 32UL) + (DMA_CH_IS_R_IS20_BIT * 4UL))))
#define DMA_BITBANDING_CH_IS_IS21    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_IS_OFFSET) * 32UL) + (DMA_CH_IS_R_IS21_BIT * 4UL))))
#define DMA_BITBANDING_CH_IS_IS22    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_IS_OFFSET) * 32UL) + (DMA_CH_IS_R_IS22_BIT * 4UL))))
#define DMA_BITBANDING_CH_IS_IS23    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_IS_OFFSET) * 32UL) + (DMA_CH_IS_R_IS23_BIT * 4UL))))
#define DMA_BITBANDING_CH_IS_IS24    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_IS_OFFSET) * 32UL) + (DMA_CH_IS_R_IS24_BIT * 4UL))))
#define DMA_BITBANDING_CH_IS_IS25    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_IS_OFFSET) * 32UL) + (DMA_CH_IS_R_IS25_BIT * 4UL))))
#define DMA_BITBANDING_CH_IS_IS26    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_IS_OFFSET) * 32UL) + (DMA_CH_IS_R_IS26_BIT * 4UL))))
#define DMA_BITBANDING_CH_IS_IS27    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_IS_OFFSET) * 32UL) + (DMA_CH_IS_R_IS27_BIT * 4UL))))
#define DMA_BITBANDING_CH_IS_IS28    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_IS_OFFSET) * 32UL) + (DMA_CH_IS_R_IS28_BIT * 4UL))))
#define DMA_BITBANDING_CH_IS_IS29    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_IS_OFFSET) * 32UL) + (DMA_CH_IS_R_IS29_BIT * 4UL))))
#define DMA_BITBANDING_CH_IS_IS30    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_IS_OFFSET) * 32UL) + (DMA_CH_IS_R_IS30_BIT * 4UL))))
#define DMA_BITBANDING_CH_IS_IS31    (*((volatile uint32_t *) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_IS_OFFSET) * 32UL) + (DMA_CH_IS_R_IS31_BIT * 4UL))))

/********************************************************************************************
************************************** 23 CHMAP0 **********************************************
********************************************************************************************/
#define DMA_BITBANDING_CH_MAP0    ((DMA_BITBANDING_CH_MAP0_t*) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_MAP0_OFFSET) * 32UL)))

/********************************************************************************************
************************************** 24 CHMAP1 **********************************************
********************************************************************************************/
#define DMA_BITBANDING_CH_MAP1    ((DMA_BITBANDING_CH_MAP1_t*) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_MAP1_OFFSET) * 32UL)))

/********************************************************************************************
************************************** 25 CHMAP2 **********************************************
********************************************************************************************/
#define DMA_BITBANDING_CH_MAP2    ((DMA_BITBANDING_CH_MAP2_t*) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_MAP2_OFFSET) * 32UL)))

/********************************************************************************************
************************************** 26 CHMAP3 *********************************************
********************************************************************************************/
#define DMA_BITBANDING_CH_MAP3    ((DMA_BITBANDING_CH_MAP3_t*) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_CH_MAP3_OFFSET) * 32UL)))

/********************************************************************************************
************************************** 27 PeriphID0 **********************************************
********************************************************************************************/
#define DMA_BITBANDING_PeriphID0    ((DMA_BITBANDING_PeriphID0_t*) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_PeriphID0_OFFSET) * 32UL)))

/********************************************************************************************
************************************** 28 PeriphID1 **********************************************
********************************************************************************************/
#define DMA_BITBANDING_PeriphID1    ((DMA_BITBANDING_PeriphID1_t*) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_PeriphID1_OFFSET) * 32UL)))

/********************************************************************************************
************************************** 29 PeriphID2 **********************************************
********************************************************************************************/
#define DMA_BITBANDING_PeriphID2    ((DMA_BITBANDING_PeriphID2_t*) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_PeriphID2_OFFSET) * 32UL)))

/********************************************************************************************
************************************** 30 PeriphID3 **********************************************
********************************************************************************************/
#define DMA_BITBANDING_PeriphID3    ((DMA_BITBANDING_PeriphID3_t*) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_PeriphID3_OFFSET) * 32UL)))

/********************************************************************************************
************************************** 31 PeriphID4 **********************************************
********************************************************************************************/
#define DMA_BITBANDING_PeriphID4    ((DMA_BITBANDING_PeriphID4_t*) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_PeriphID4_OFFSET) * 32UL)))

/********************************************************************************************
************************************** 32 PCellID0 **********************************************
********************************************************************************************/
#define DMA_BITBANDING_PCellID0    ((DMA_BITBANDING_PCellID0_t*) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_PCellID0_OFFSET) * 32UL)))

/********************************************************************************************
************************************** 33 PCellID1 **********************************************
********************************************************************************************/
#define DMA_BITBANDING_PCellID1    ((DMA_BITBANDING_PCellID1_t*) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_PCellID1_OFFSET) * 32UL)))

/********************************************************************************************
************************************** 34 PCellID2 **********************************************
********************************************************************************************/
#define DMA_BITBANDING_PCellID2    ((DMA_BITBANDING_PCellID2_t*) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_PCellID2_OFFSET) * 32UL)))

/********************************************************************************************
************************************** 35 PCellID3 **********************************************
********************************************************************************************/
#define DMA_BITBANDING_PCellID3    ((DMA_BITBANDING_PCellID3_t*) (DMA_BITBANDING_BASE + ((DMA_OFFSET + DMA_PCellID3_OFFSET) * 32UL)))

#endif /* XDRIVER_MCU_DRIVER_HEADER_DMA_DMA_PERIPHERAL_DMA_REGISTER_DMA_REGISTERPERIPHERAL_BITBANDING_H_ */
